## software_asset_inventory
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 2 to change, 2 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.dependencytrack_api will be updated in-place
  ~ resource "aws_ecs_service" "dependencytrack_api" {
        id                                 = "arn:aws:ecs:ca-central-1:794722365809:service/software_asset_tracking/dependencytrack_api"
        name                               = "dependencytrack_api"
        tags                               = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-software-asset-inventory"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:794722365809:task-definition/dependencytrack_api:15" -> (known after apply)
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_ecs_service.dependencytrack_frontend will be updated in-place
  ~ resource "aws_ecs_service" "dependencytrack_frontend" {
        id                                 = "arn:aws:ecs:ca-central-1:794722365809:service/software_asset_tracking/dependencytrack_frontend"
        name                               = "dependencytrack_frontend"
        tags                               = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-software-asset-inventory"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:794722365809:task-definition/dependencytrack_frontend:5" -> (known after apply)
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.dependencytrack_api must be replaced
-/+ resource "aws_ecs_task_definition" "dependencytrack_api" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:794722365809:task-definition/dependencytrack_api:15" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  ~ image            = "dependencytrack/apiserver:4.5.0@sha256:9365f306ac54eaf1216ad8f2846062b3fe538399d8fb10a11e82be20c8c8e797" -> "dependencytrack/apiserver:4.6.1@sha256:54a44aab50129bcf0ae3dbeea2508870b48af132969a6929f0a75c772db7079b"
                    name             = "dependencytrack_api"
                  - volumesFrom      = [] -> null
                    # (7 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "dependencytrack_api" -> (known after apply)
      ~ revision                 = 15 -> (known after apply)
        tags                     = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-software-asset-inventory"
            "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)

      - volume {
          - name = "dependencytrack_api" -> null

          - efs_volume_configuration {
              - file_system_id          = "fs-00d2fbd255781e5ec" -> null
              - root_directory          = "/" -> null
              - transit_encryption      = "ENABLED" -> null
              - transit_encryption_port = 0 -> null

              - authorization_config {
                  - access_point_id = "fsap-097132859e0c22c68" -> null
                  - iam             = "DISABLED" -> null
                }
            }
        }
      + volume {
          + name = "dependencytrack_api"

          + efs_volume_configuration {
              + file_system_id     = "fs-00d2fbd255781e5ec"
              + root_directory     = "/"
              + transit_encryption = "ENABLED"

              + authorization_config {
                  + access_point_id = "fsap-097132859e0c22c68"
                  + iam             = "DISABLED"
                }
            }
        }
    }

  # aws_ecs_task_definition.dependencytrack_frontend must be replaced
-/+ resource "aws_ecs_task_definition" "dependencytrack_frontend" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:794722365809:task-definition/dependencytrack_frontend:5" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - cpu              = 0 -> null
                  ~ image            = "794722365809.dkr.ecr.ca-central-1.amazonaws.com/security-tools/software_asset_inventory/dependencytrack_frontend:latest" -> "dependencytrack/frontend:4.6.0@sha256:a525d909ecf6cecf4a0302a95b406e494ae155a9a148be019ab93f1d5f7c415d"
                  - mountPoints      = [] -> null
                    name             = "dependencytrack_frontend"
                  - volumesFrom      = [] -> null
                    # (4 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "dependencytrack_frontend" -> (known after apply)
      ~ revision                 = 5 -> (known after apply)
        tags                     = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-software-asset-inventory"
            "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
